# Taps
tap "homebrew/cask-fonts"

# Shell
brew "cairo"
brew "coreutils"
brew "curl"
brew "fd"
brew "jq"
brew "ripgrep"
brew "xz"
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "kitty"

# Programming Related
brew "asdf"
brew "awscli"
brew "git"
brew "tmux"

# Code / Text Editors
brew "neovim"
cask "intellij-idea-ce"
cask "mactex"
cask "obsidian"
cask "sublime-text"
cask "visual-studio-code"

# Productivity Apps
brew "pass"
brew "yadm"
cask "discord"
cask "elgato-stream-deck"
cask "google-chrome"
cask "libreoffice"
cask "logi-options-plus"
cask "private-internet-access"
cask "rectangle"
cask "vlc"

# Playing Around
brew "stockfish"
cask "chessx"

# VSCode Extensions
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "PKief.material-icon-theme"
vscode "redhat.java"
vscode "svelte.svelte-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
