# cli
brew "bat"
brew "bison"
brew "cmake"
brew "curl"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "jq"
brew "just"
brew "lazygit"
brew "libsodium"
brew "mise"
brew "ninja"
brew "pandoc"
brew "pass"
brew "postgresql@17"
brew "pre-commit"
brew "ripgrep"
brew "selene"
brew "shellcheck"
brew "sqlite"
brew "stylua"
brew "tlrc"
brew "tmux"
brew "websocat"
brew "wget"
brew "yadm"

# plugin
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# util
brew "cairo"
brew "coreutils"
brew "gpatch"
brew "oath-toolkit"
brew "pkg-config"
brew "xz"

# terminal
cask "alacritty"
cask "ghostty"
cask "kitty"
cask "wezterm"

# font
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"

# editor
brew "neovim"
brew "vim"
cask "intellij-idea-ce"
cask "mactex"
cask "sublime-text"
cask "visual-studio-code"

# productivity
cask "discord"
cask "elgato-stream-deck"
cask "google-chrome"
cask "libreoffice"
cask "private-internet-access"
cask "rectangle"
cask "vlc"

# other
brew "stockfish"
