# Taps
tap "homebrew/cask-fonts"

# Programming Related
brew "asdf"
brew "bison"
brew "curl"
brew "fd"
brew "git"
brew "git-delta"
brew "jq"
brew "just"
brew "libsodium"
brew "luarocks"
brew "pandoc"
brew "ripgrep"
brew "~/.config/tmux/tmux.rb"
brew "wget"
brew "yadm"
brew "zsh-syntax-highlighting"

# Terminals
cask "alacritty"
cask "kitty"
cask "wezterm"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"

# General
brew "cairo"
brew "cmake"
brew "coreutils"
brew "glow"
brew "oath-toolkit"
brew "pass"
brew "pkg-config"
brew "xz"

# Code / Text Editors
brew "neovim"
cask "intellij-idea-ce"
cask "mactex"
cask "sublime-text"
cask "visual-studio-code"

# Productivity Apps
cask "discord"
cask "elgato-stream-deck"
cask "google-chrome"
cask "libreoffice"
cask "logi-options-plus"
cask "private-internet-access"
cask "rectangle"
cask "vlc"

# Playing Around
brew "mpv"
brew "stockfish"
cask "chessx"
